export const guild_events = [
    {
        text: "Через пять минут начнется событие 'БДСМ-сессия с Беарой'!",
        important: false,
        day: 1,
        time: "16:55:00",
    },
    {
        text: "Через пять минут начнется событие 'Остров Расколотых Задниц'!",
        important: false,
        day: 2,
        time: "16:55:00",
    },
    {
        text: "Через пять минут появятся Големы! (Межсерверное событие)",
        important: false,
        day: 2,
        time: "18:55:00",
    },
    {
        text: "Через пять минут начнется событие 'Темный афкающий легион'!",
        important: false,
        day: 3,
        time: "16:55:00",
    },
    {
        text: "Через пять минут появится кекзекутор!",
        important: false,
        day: 3,
        time: "18:55:00",
    },
    {
        text: "Не забудьте напомнить Плути про повозку! А еще там Снежный Пик через 5 минут.",
        important: true,
        day: 4,
        time: "16:55:00",
    },
    {
        text: "Через пять минут появятся Големы! (Межсерверное событие)",
        important: false,
        day: 4,
        time: "18:55:00",
    },
    {
        text: "Собираемся на турнир! Первый бой начнётся через 10 минут.",
        important: true,
        day: 5,
        time: "16:50:00",
    },
    {
        text: "Через пять минут появится кекзекутор! (Сегодня не для слабонервных)",
        important: false,
        day: 5,
        time: "18:55:00",
    },
    {
        text: "Собираемся на осадные бои!",
        important: true,
        day: 6,
        time: "16:31:00",
    },
    {
        text: "Осада началась!",
        important: true,
        day: 6,
        time: "17:31:00",
    },
    {
        text: "В это время обычно собирается на межсерверные фановые бои.",
        important: false,
        day: 7,
        time: "16:50:00",
    }
];